---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationAncillaryUsage Properties
FabricationAncillaryUsage Class See Also Send Feedback
---

The FabricationAncillaryUsage type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AncillaryDepth | Depth of required ancillary if it isn't round. |
|  | AncillaryId | Fabrication ancillary database identifier. |
|  | AncillaryWidthOrDiameter | Width or diameter of required ancillary. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | Length of required ancillaries. |
|  | ProductCode | A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it. |
|  | Quantity | Quantity of required ancillaries. |
|  | Type | Fabrication ancillary type. |
|  | UsageType | Fabrication ancillary usage type. |

# See Also

FabricationAncillaryUsage Class

Autodesk.Revit.DB Namespace